Pandas can be used for many Data Engineering and Data Exploration related operations,
we will be mainly using pandas for = 

1. Data Import/Export
2. Data Manipualtion - selection, filtering
3. Data Cleaning
4. Data Aggregation
5. Descriptive statistical analysis

Pandas has two popular data types - 
1. Pandas Series - 1D Data
2. Pandas DataFrame - 2D Data

In [1]:
import pandas as pd

In [2]:
# series = 1D Data
x = pd.Series([12,45,23,12,56,23,45,78,56,12,15,14,25],name ="Age")
x

0     12
1     45
2     23
3     12
4     56
5     23
6     45
7     78
8     56
9     12
10    15
11    14
12    25
Name: Age, dtype: int64

In [3]:
data = {"Name":["Anshu","Feri","Andi","Wendo","Arkan","Kati","Nur","Nurul","Edwin","Melissa"],
         "City":["Delhi","Jakarta","Jakarta","Bandung","Bandung","Jakarta","Singpore","New York","London","Paris"],
       "Gender":["M","M","M","M","M","F","F","F","M","F",],
       "Age":[45,30,24,21,42,21,28,21,31,24]}


df = pd.DataFrame(data)
df

      Name      City Gender  Age
0    Anshu     Delhi      M   45
1     Feri   Jakarta      M   30
2     Andi   Jakarta      M   24
3    Wendo   Bandung      M   21
4    Arkan   Bandung      M   42
5     Kati   Jakarta      F   21
6      Nur  Singpore      F   28
7    Nurul  New York      F   21
8    Edwin    London      M   31
9  Melissa     Paris      F   24

### Data Manipulation

#### selection

In [4]:
df["Name"]

0      Anshu
1       Feri
2       Andi
3      Wendo
4      Arkan
5       Kati
6        Nur
7      Nurul
8      Edwin
9    Melissa
Name: Name, dtype: object

In [5]:
df[["Name","Gender"]]

      Name Gender
0    Anshu      M
1     Feri      M
2     Andi      M
3    Wendo      M
4    Arkan      M
5     Kati      F
6      Nur      F
7    Nurul      F
8    Edwin      M
9  Melissa      F

In [6]:
df[2:6]

    Name     City Gender  Age
2   Andi  Jakarta      M   24
3  Wendo  Bandung      M   21
4  Arkan  Bandung      M   42
5   Kati  Jakarta      F   21

In [7]:
df[2:6][["Name","Gender"]]

    Name Gender
2   Andi      M
3  Wendo      M
4  Arkan      M
5   Kati      F

In [8]:
df[2:3]

   Name     City Gender  Age
2  Andi  Jakarta      M   24

In [9]:
df.head() # top 5 rows of dataframe

    Name     City Gender  Age
0  Anshu    Delhi      M   45
1   Feri  Jakarta      M   30
2   Andi  Jakarta      M   24
3  Wendo  Bandung      M   21
4  Arkan  Bandung      M   42

In [10]:
df.head(2) # top 2 rows

    Name     City Gender  Age
0  Anshu    Delhi      M   45
1   Feri  Jakarta      M   30

In [11]:
df.tail(2) # bottom 2 rows

      Name    City Gender  Age
8    Edwin  London      M   31
9  Melissa   Paris      F   24

### Filtering

In [12]:
df[df["Gender"]=='F'] # category based filter

      Name      City Gender  Age
5     Kati   Jakarta      F   21
6      Nur  Singpore      F   28
7    Nurul  New York      F   21
9  Melissa     Paris      F   24

In [13]:
df[df['Age']>25]

    Name      City Gender  Age
0  Anshu     Delhi      M   45
1   Feri   Jakarta      M   30
4  Arkan   Bandung      M   42
6    Nur  Singpore      F   28
8  Edwin    London      M   31

In [14]:
df[df["Gender"]=="M"][df['Age']>25]

<ipython-input-14-21cdcdac0207>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df["Gender"]=="M"][df['Age']>25]

    Name     City Gender  Age
0  Anshu    Delhi      M   45
1   Feri  Jakarta      M   30
4  Arkan  Bandung      M   42
8  Edwin   London      M   31

In [15]:
df["Gender"]=="M"

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
8     True
9    False
Name: Gender, dtype: bool